# Analyzing borrowers’ risk of defaulting

This project is to prepare a report for a bank’s loan division. The aim is to find out if a customer’s marital status and number of children has an impact on whether they will default on a loan. The bank already has some data on customers’ credit worthiness.

This report will be considered when building the **credit score** of a potential customer. The **credit score** is used to evaluate the ability of a potential borrower to repay their loan.

## Open the data file and have a look at the general information. 

We will start by importing the necessary libraries that we would need to undertake the project.

In [1]:
# Loading all the libraries
import pandas as pd
import numpy as np

In [2]:
# Load the data

customer_data = pd.read_csv('/datasets/credit_scoring_eng.csv' )

#### Task 1. Data exploration

**Description of the data**
- `children` - the number of children in the family
- `days_employed` - work experience in days
- `dob_years` - client's age in years
- `education` - client's education
- `education_id` - education identifier
- `family_status` - marital status
- `family_status_id` - marital status identifier
- `gender` - gender of the client
- `income_type` - type of employment
- `debt` - was there any debt on loan repayment
- `total_income` - monthly income
- `purpose` - the purpose of obtaining a loan

Now we are going to explore the data and see how many columns and rows are present. We would also like to look for any issues that are present in the data.

In [3]:
# Let's see how many rows and columns our dataset has
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [4]:
# let's print the first N rows
customer_data.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,-2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,-152.779569,50,SECONDARY EDUCATION,1,married,0,M,employee,0,21731.829,education
8,2,-6929.865299,35,BACHELOR'S DEGREE,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,-2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family

From the printed data, There are 12 columns and 21525 rows in the data. We see that the days_employed column has negative values and is of the type float. The education column as well, has some values that are in uppercase and some in lower case that may affect the analysis. We will change these to lower case to make the analysis better. total_income column as well would need to be rounded off to 2 decimal places.

In [5]:
# Get info on data
customer_data.info()
print(customer_data['days_employed'].isna().sum())
print(customer_data['total_income'].isna().sum())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB
2174
2174

We can see that there are some missing values in the days_employed column and total_income column.

In [6]:
# Let's look in the filtered table at the the first column with missing data
missing_data_days_employed = customer_data[customer_data['days_employed'].isna()]
missing_data_days_employed

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

The missing values for day_employed and total_income seem to be symmentrical with each other and the education type of the person. This means that all customers with missing values on the day_employed column also have corresponding missing values in the total_income column. We may however not be sure as we can only see a sample of the data.

In [7]:
# Let's apply multiple conditions for filtering data and look at the number of rows in the filtered table.

missing_data_total_income = customer_data[customer_data['total_income'].isna()]
display(missing_data_total_income)

display(customer_data.isna().sum())

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

**Intermediate conclusion**

The number of rows in the filtered table matches the number of missing values. From this we can conclude that for every missing value in the day_employed column, there is a corresponding missing value in the total_income column. 

We will calculate the percentage of missing values compared to the whole dataset to determine if they make up a large portion of it. This will enable us to determine if we would need to replace the missing values or drop them.

In the event we would need to fill in the missing values, we would need to determine if the missing values are due to some client characterstics in the data provided or if they are dependent.

In [8]:
### Let's investigate clients who do not have data on identified characteristic and the column with the missing values

distribution_list = ['children','dob_years','education','education_id','family_status','family_status_id','gender','income_type','debt']

for item in distribution_list:
    display(missing_data_total_income[item].value_counts())


missing_values_percent = display((customer_data['days_employed'].isna().sum()+customer_data['total_income'].isna().sum())/len(customer_data))

 0     1439
 1      475
 2      204
 3       36
 20       9
 4        7
-1        3
 5        1
Name: children, dtype: int64

34    69
40    66
31    65
42    65
35    64
36    63
47    59
41    59
30    58
28    57
57    56
58    56
54    55
38    54
56    54
37    53
52    53
39    51
33    51
50    51
51    50
45    50
49    50
29    50
43    50
46    48
55    48
48    46
53    44
44    44
60    39
61    38
62    38
64    37
32    37
27    36
23    36
26    35
59    34
63    29
25    23
24    21
66    20
65    20
21    18
22    17
67    16
0     10
68     9
69     5
20     5
71     5
70     3
72     2
19     1
73     1
Name: dob_years, dtype: int64

secondary education    1408
bachelor's degree       496
SECONDARY EDUCATION      67
Secondary Education      65
some college             55
Bachelor's Degree        25
BACHELOR'S DEGREE        23
primary education        19
Some College              7
SOME COLLEGE              7
PRIMARY EDUCATION         1
Primary Education         1
Name: education, dtype: int64

1    1540
0     544
2      69
3      21
Name: education_id, dtype: int64

married              1237
civil partnership     442
unmarried             288
divorced              112
widow / widower        95
Name: family_status, dtype: int64

0    1237
1     442
4     288
3     112
2      95
Name: family_status_id, dtype: int64

F    1484
M     690
Name: gender, dtype: int64

employee         1105
business          508
retiree           413
civil servant     147
entrepreneur        1
Name: income_type, dtype: int64

0    2004
1     170
Name: debt, dtype: int64

0.20199767711962835

# Checking distribution

The percentage of the missing values to the total data is about 20%. This is quite a significant amount of data. We would need to fill in the missing values. In investigating the data however, we did not see if any of the missing values were due to specific characteristics of the client or whether they have any dependences. 
**Possible reasons for missing values in data**

The data does not seem to have a pattern with the other columns as we have missing values in each category investigated. As a result we would need to fill in the values with either the mean or median of a category that might affect the missing values.

In [9]:
# Checking the distribution in the whole dataset


distribution_list = ['children','dob_years','education','education_id','family_status','family_status_id','gender','income_type','debt']

for item in distribution_list:
    display(customer_data[item].value_counts())

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

35    617
40    609
41    607
34    603
38    598
42    597
33    581
39    573
31    560
36    555
44    547
29    545
30    540
48    538
37    537
50    514
43    513
32    510
49    508
28    503
45    497
27    493
56    487
52    484
47    480
54    479
46    475
58    461
57    460
53    459
51    448
59    444
55    443
26    408
60    377
25    357
61    355
62    352
63    269
64    265
24    264
23    254
65    194
66    183
22    183
67    167
21    111
0     101
68     99
69     85
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

secondary education    13750
bachelor's degree       4718
SECONDARY EDUCATION      772
Secondary Education      711
some college             668
BACHELOR'S DEGREE        274
Bachelor's Degree        268
primary education        250
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
Graduate Degree            1
GRADUATE DEGREE            1
Name: education, dtype: int64

1    15233
0     5260
2      744
3      282
4        6
Name: education_id, dtype: int64

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

0    12380
1     4177
4     2813
3     1195
2      960
Name: family_status_id, dtype: int64

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
paternity / maternity leave        1
student                            1
Name: income_type, dtype: int64

0    19784
1     1741
Name: debt, dtype: int64

**Intermediate conclusion**

The distributon of the original dataset and the filtered dataset look similar. We may need to investigate the data abit more to gain some more understanding.

In [10]:
# Check for other reasons and patterns that could lead to missing values
customer_data.describe()
distribution_list2 = ['education','children','dob_years','family_status','gender','income_type','debt']

for item in distribution_list:
    display(missing_data_total_income[item].unique())

array([ 0,  1,  2, -1,  3,  4, 20,  5])

array([65, 41, 63, 50, 54, 21, 52, 32, 35, 34, 44, 47, 46, 29, 27, 39, 62,
       55, 26, 30, 31, 23, 58, 60, 40, 66, 33, 56, 69, 59, 57, 45, 53, 48,
       51, 37, 43, 24, 28, 67, 64, 25, 49, 42, 61, 36, 70, 38, 20,  0, 68,
       19, 22, 71, 72, 73])

array(['secondary education', "bachelor's degree", 'SECONDARY EDUCATION',
       'some college', 'Secondary Education', 'Some College',
       "Bachelor's Degree", 'SOME COLLEGE', 'primary education',
       "BACHELOR'S DEGREE", 'Primary Education', 'PRIMARY EDUCATION'],
      dtype=object)

array([1, 0, 2, 3])

array(['civil partnership', 'married', 'unmarried', 'widow / widower',
       'divorced'], dtype=object)

array([1, 0, 4, 2, 3])

array(['M', 'F'], dtype=object)

array(['retiree', 'civil servant', 'business', 'employee', 'entrepreneur'],
      dtype=object)

array([0, 1])

**Intermediate conclusion**

from conducting further investigations, the missing values seem to be accidental. We also noticed some descrepancies with the ages,ie, age 0 as well as family status.

In [11]:
# Checking for other patterns - explain which
missing_data_total_income.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
65,0,NaN,21,secondary education,1,unmarried,4,M,business,0,NaN,transactions with commercial real estate
67,0,NaN,52,bachelor's degree,0,married,0,F,retiree,0,NaN,purchase of the house for my family
72,1,NaN,32,bachelor's degree,0,married,0,M,civil servant,0,NaN,transactions with commercial real estate
82,2,NaN,50,bachelor's degree,0,married,0,F,employee,0,NaN,housing
83,0,NaN,52,secondary education,1,married,0,M,employee,0,NaN,housing

**Conclusions**

In examining the data, we see that the missing values only correspond to eachother. days_employed maps with total_income. The same number of missing values in the days_employed and total_income column. This means that total income depends on days_employed.

From investigation, we would fill in the missing values with the mean or median of the total_income based on the different categories in the income_type column. This is because, the type of income you make, usually determines the income amount. 


I would now check for any duplications in the data, mispelled/misformatted words as well as missing values. Rectifying these would enable me to undertake a more accurate analysis on the data presented.

## Data transformation

Let's go through each column to see what issues we may have in them.

We will begin with removing duplicates and fixing educational information.

In [12]:
# Let's see all values in education column to check if and what spellings will need to be fixed
customer_data = customer_data.drop_duplicates().reset_index(drop=True)
customer_data['education'].unique()

array(["bachelor's degree", 'secondary education', 'Secondary Education',
       'SECONDARY EDUCATION', "BACHELOR'S DEGREE", 'some college',
       'primary education', "Bachelor's Degree", 'SOME COLLEGE',
       'Some College', 'PRIMARY EDUCATION', 'Primary Education',
       'Graduate Degree', 'GRADUATE DEGREE', 'graduate degree'],
      dtype=object)

In [13]:
# Fix the registers if required
customer_data['education'] = customer_data['education'].str.lower()

In [14]:
# Checking all the values in the column to make sure we fixed them
display(customer_data['education'].unique())

display(customer_data['education'].value_counts())

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

secondary education    15188
bachelor's degree       5251
some college             744
primary education        282
graduate degree            6
Name: education, dtype: int64

Checking the `children` column

In [15]:
# Let's see the distribution of values in the `children` column
display(customer_data['children'].unique())

print('The percentage of the issues to total data is:')
display((len(customer_data[customer_data['children']==-1]) 
       + len(customer_data[customer_data['children']==20]))/len(customer_data['children']))

array([ 1,  0,  3,  2, -1,  4, 20,  5])

The percentage of the issues to total data is:

0.005728657258627917

In the customer column, we see that we have a negative number of children which is impossible. We cant have negative children as well as a very large number 20. This makes about 0.57% of the data total data. These issues are few and seem like human error hence the best course of action is to replace them.

In [16]:
# fixing the data
# replacing all data points corresponding to 20 children

customer_data.loc[customer_data['children']== 20,'children'] = 2

In [17]:
# fixing the data
# replacing all data points corresponding to -1 children

customer_data.loc[customer_data['children']== -1,'children'] = 1

In [18]:
# Checking the `children` column again to make sure it's all fixed

display(customer_data[customer_data['children'] == 20])
display(customer_data[customer_data['children'] == -1])

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose]
Index: []

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose]
Index: []

Checking the data in the `days_employed` column.

In [19]:
# Find problematic data in `days_employed`, if they exist, and calculate the percentage

display(customer_data[['days_employed','dob_years']])

customer_data['dob_days'] = customer_data['dob_years'] * 365
display(customer_data[['days_employed','dob_years','dob_days']])

display(len(customer_data[customer_data['days_employed']<0])/len(customer_data))

display((customer_data['days_employed']).notna().sum())

larger_days_employed = customer_data[customer_data['days_employed'] > customer_data['dob_days']]

display(larger_days_employed[['days_employed','dob_days']])

       days_employed  dob_years
0       -8437.673028         42
1       -4024.803754         36
2       -5623.422610         33
3       -4124.747207         32
4      340266.072047         53
...              ...        ...
21466   -4529.316663         43
21467  343937.404131         67
21468   -2113.346888         38
21469   -3112.481705         38
21470   -1984.507589         40

[21471 rows x 2 columns]

       days_employed  dob_years  dob_days
0       -8437.673028         42     15330
1       -4024.803754         36     13140
2       -5623.422610         33     12045
3       -4124.747207         32     11680
4      340266.072047         53     19345
...              ...        ...       ...
21466   -4529.316663         43     15695
21467  343937.404131         67     24455
21468   -2113.346888         38     13870
21469   -3112.481705         38     13870
21470   -1984.507589         40     14600

[21471 rows x 3 columns]

0.7408131898840297

19351

       days_employed  dob_days
4      340266.072047     19345
18     400281.136913     19345
24     338551.952911     20805
25     363548.489348     24455
30     335581.668515     22630
...              ...       ...
21451  338904.866406     19345
21454  386497.714078     22630
21455  362161.054124     21535
21464  373995.710838     21535
21467  343937.404131     24455

[3445 rows x 2 columns]

looking at the days_employed data, we see that we have about 74% of the data being negative numbers which is quite high. This could be a technical error. The best way to correct this would be to make them all positive integers. We also have some days employed being higher than the age of the person. We converted the dob_years column to days and found those days and then we replaced them with the median number of days employed.

In [20]:
# Changing the problematic figures to positive numbers
customer_data['days_employed'] = customer_data['days_employed'].abs()
# finding the median of the day_employed column
age_comparison = customer_data[['days_employed','dob_days']]

median_days_employed = age_comparison['days_employed'].median()
display(median_days_employed)

#comparing the days employed and dob days column
age_comparison = age_comparison.sort_values('days_employed')
display(age_comparison)


#replacing the larger days employed columns with the median
greater_than_dob = customer_data['days_employed'] > customer_data['dob_days']
dob_greater_than_zero = customer_data['dob_days'] > 0                                                                
customer_data.loc[greater_than_dob & dob_greater_than_zero,'days_employed'] = 2194.220566878695

2194.220566878695

       days_employed  dob_days
17405      24.141633     11315
8331       24.240695     11680
6153       30.195337     17155
9674       33.520665     15695
2127       34.701045     11315
...              ...       ...
21435            NaN     17155
21441            NaN     18250
21443            NaN     17520
21448            NaN     15330
21456            NaN     10220

[21471 rows x 2 columns]

In [21]:
# Check the result - make sure it's fixed
display(customer_data['days_employed'])
display(customer_data[customer_data['dob_days'] > 0 ]['days_employed'].value_counts())

0        8437.673028
1        4024.803754
2        5623.422610
3        4124.747207
4        2194.220567
            ...
21466    4529.316663
21467    2194.220567
21468    2113.346888
21469    3112.481705
21470    1984.507589
Name: days_employed, Length: 21471, dtype: float64

2194.220567    3429
142.276217        1
993.995430        1
516.247240        1
812.816317        1
               ...
4423.502268       1
1108.760515       1
235.478590        1
2084.594903       1
1636.419775       1
Name: days_employed, Length: 15832, dtype: int64

Let's now look at the client's age and whether there are any issues there.

In [22]:
# Check the `dob_years` for suspicious values and count the percentage

display(customer_data['dob_years'].unique())


customer_data['dob_years'] =  customer_data['dob_years'].sort_values()

display(len(customer_data[customer_data['dob_years'] == 0])/len(customer_data))
display(customer_data['dob_years'].median())
display(customer_data['dob_years'].mean())

array([42, 36, 33, 32, 53, 27, 43, 50, 35, 41, 40, 65, 54, 56, 26, 48, 24,
       21, 57, 67, 28, 63, 62, 47, 34, 68, 25, 31, 30, 20, 49, 37, 45, 61,
       64, 44, 52, 46, 23, 38, 39, 51,  0, 59, 29, 60, 55, 58, 71, 22, 73,
       66, 69, 19, 72, 70, 74, 75])

0.004704019374970891

42.0

43.279074099948765

The age column contains age 0 which seems like an error as we cant have a person being zero years. we would drop these rows as they make about 0.47% of the total data.

In [23]:
# Replacing all ages equal to 0
customer_data.loc[customer_data['dob_years']== 0,'dob_years'] = 42

In [24]:
# Check the result - make sure it's fixed
customer_data.loc[customer_data['dob_years'] == 0]

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose, dob_days]
Index: []

Now let's check the `family_status` column.

In [25]:
# Let's see the values for the column

display(customer_data['family_status'].unique())

print(customer_data['family_status'].value_counts())
print()
print(customer_data[customer_data['family_status']=='widow / widower']['gender'].value_counts())

array(['married', 'civil partnership', 'widow / widower', 'divorced',
       'unmarried'], dtype=object)

married              12344
civil partnership     4163
unmarried             2810
divorced              1195
widow / widower        959
Name: family_status, dtype: int64

F    904
M     55
Name: gender, dtype: int64

# Addressing the problematic values in `family_status`
 
 Now we are checking the family status row to see if there are any issues that need to be fixed.

In [26]:
#replacing all widow / widower to widow if the person is female and widower if the person is male.
customer_data.loc[(customer_data['family_status']=='widow / widower') &(customer_data['gender']=='F'),'family_status']='widow'
customer_data.loc[(customer_data['family_status']=='widow / widower') &(customer_data['gender']=='M'),'family_status']='widower'

In [27]:
# Check the result - make sure it's fixed
display(customer_data[customer_data['family_status']==42])
display(customer_data[customer_data['family_status']=='widow / widower'])
display(customer_data.head(10))

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose, dob_days]
Index: []

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose, dob_days]
Index: []

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,dob_days
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,15330
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,13140
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,12045
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,11680
4,0,2194.220567,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,19345
5,0,926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house,9855
6,0,2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions,15695
7,0,152.779569,50,secondary education,1,married,0,M,employee,0,21731.829,education,18250
8,2,6929.865299,35,bachelor's degree,0,civil partnership,1,F,employee,0,15337.093,having a wedding,12775
9,0,2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family,14965

Now let's check the `gender` column to see what kind of values there are and what problems we may need to address

In [28]:
# Let's see the values in the column
display(customer_data['gender'].unique())
display(customer_data['gender'].value_counts())
customer_data[customer_data['gender']=='XNA']

array(['F', 'M', 'XNA'], dtype=object)

F      14189
M       7281
XNA        1
Name: gender, dtype: int64

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,dob_days
10690,0,2358.600502,24,some college,2,civil partnership,1,XNA,business,0,32624.825,buy real estate,8760

In [29]:
# dropping the unidentified gender row
customer_data.loc[customer_data['gender']== 'XNA','gender'] = 'unknown'

In [30]:
# Check the result - make sure it's fixed

customer_data[customer_data['gender']=='XNA']

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose, dob_days]
Index: []

Now let's check the `income_type` column to see what kind of values there are and what problems we may need to address

In [31]:
# Let's see the values in the column
display(customer_data['income_type'].unique())

customer_data[customer_data['income_type']=='paternity / maternity leave']

array(['employee', 'retiree', 'business', 'civil servant', 'unemployed',
       'entrepreneur', 'student', 'paternity / maternity leave'],
      dtype=object)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,dob_days
20795,2,3296.759962,39,secondary education,1,married,0,F,paternity / maternity leave,1,8612.661,car,14235

In [32]:
# Address the problematic values, if they exist
customer_data.loc[(customer_data['income_type'] == 'paternity / maternity leave') & (customer_data['gender'] == 'F'),'income_type']='maternity leave'

In [33]:
# Check the result - make sure it's fixed
customer_data[customer_data['income_type'] == 'paternity / maternity leave']

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose, dob_days]
Index: []

Now let's see if we have any duplicates in our data. If we do, we will need to drop them to prevent them from elevating our numbers.

In [34]:
# Checking duplicates
display(customer_data.duplicated().sum())

17

In [35]:
# Addressing the duplicates
customer_data = customer_data.drop_duplicates().reset_index(drop=True)

In [36]:
# Last check whether we have any duplicates
customer_data.duplicated().sum()

0

In [37]:
# Check the size of the dataset
customer_data.info()
(21525-21470)/21525

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21454 non-null  int64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21454 non-null  object
 12  dob_days          21454 non-null  int64
dtypes: float64(2), int64(6), object(5)
memory usage: 2.1+ MB

0.0025551684088269454


After cleaning the data we noticed that there were alot of duplicate values which we dropped, capitalization of data points and data that did not match with the dataset. The data reduced by about 0.3% from 21525 rows down to 21470 rows which is not that much.

# Working with missing values

To speed up working with some data, we will create dictionaries for the education and family status columns. This is because it would be easier to identify the category withouht making any mistakes with the spelling of the name.[you may want to work with dictionaries for some values, where IDs are provided. Explain why and which dictionaries you will work with.]

In [38]:
# Find the dictionaries
education = customer_data[['education','education_id']].drop_duplicates().reset_index(drop=True)
education ={0:"bachelor's degree",1:'secondary education',2:'some college',3:'primary education',4:'graduate degree'}

education

{0: "bachelor's degree",
 1: 'secondary education',
 2: 'some college',
 3: 'primary education',
 4: 'graduate degree'}

In [39]:
family_status = customer_data[['family_status','family_status_id']].drop_duplicates().reset_index(drop=True)
family_status = {0:'married',1:'civil partnership',2:'widow',3:'divorced',4:'unmarried',5:'widower'}
family_status

{0: 'married',
 1: 'civil partnership',
 2: 'widow',
 3: 'divorced',
 4: 'unmarried',
 5: 'widower'}

### Restoring missing values in `total_income`

The days_employed and total_income columns have missing values. This makes up about 74% of the total data. We would first identify which columns relate to the missing values data. Then we would replace the missing values with either the mean or median based on the category groups.

In [40]:
# Let's write a function that calculates the age category
def age_cat(num):
    if num < 0 or pd.isna(num):
        return 'na'
    elif num < 10:
        return '0-9'
    elif num < 20:
        return '10-19'
    elif num < 30:
        return '20-29'
    elif num < 40:
        return '30-39'
    elif num < 50:
        return '40-49'
    elif num < 60:
        return '50-59'
    elif num < 70:
        return '60-69'
    else:
        return '70+'

In [41]:
# Test if the function works

age_cat(61)

'60-69'

In [42]:
# Creating new column based on function

customer_data['dob_years_category'] = customer_data['dob_years'].apply(age_cat)

In [43]:
# Checking how values in the new column

customer_data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,dob_days,dob_years_category
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,15330,40-49
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,13140,30-39
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,12045,30-39
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,11680,30-39
4,0,2194.220567,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,19345,50-59

The factors that income usually depends on are the income_type,eg, business, entrepreneur,etc. We would need to decide if we are using the median or mean to replace the missing values. To do this, we would need to look at the distribution of this column.

Creating a table that only has data without missing values. This data will be used to restore the missing values.

In [44]:
# Creating a table without missing values and printing a few of its rows to make sure it looks fine

new_customer_data = customer_data[customer_data['days_employed'].notna()]
new_customer_data

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,dob_days,dob_years_category
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,15330,40-49
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,13140,30-39
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,12045,30-39
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,11680,30-39
4,0,2194.220567,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,19345,50-59
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21449,1,4529.316663,43,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions,15695,40-49
21450,0,2194.220567,67,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car,24455,60-69
21451,1,2113.346888,38,secondary education,1,civil partnership,1,M,employee,1,14347.610,property,13870,30-39
21452,3,3112.481705,38,secondary education,1,married,0,M,employee,1,39054.888,buying my own car,13870,30-39
21453,2,1984.507589,40,secondary education,1,married,0,F,employee,0,13127.587,to buy a car,14600,40-49

In [45]:
# Look at the mean values for income based on your identified factors
new_customer_data['total_income'] = new_customer_data['total_income'].sort_values()


display(round(new_customer_data.groupby('days_employed')['total_income'].mean(),2))
print()
print(round(new_customer_data.groupby('education')['total_income'].mean()),2)
print()
print(round(new_customer_data.groupby('income_type')['total_income'].mean()),2)

/tmp/ipykernel_28/530052453.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_customer_data['total_income'] = new_customer_data['total_income'].sort_values()

days_employed
24.141633        26712.39
24.240695        19858.46
30.195337        37033.79
33.520665        20568.94
34.701045        14489.28
                   ...
371665.278622    16419.47
394949.344851     5595.91
395893.813367    34925.56
397856.565013    15619.31
400992.375704    13954.47
Name: total_income, Length: 15923, dtype: float64

education
bachelor's degree      33143.0
graduate degree        27960.0
primary education      21145.0
secondary education    24595.0
some college           29045.0
Name: total_income, dtype: float64 2

income_type
business           32387.0
civil servant      27344.0
employee           25821.0
entrepreneur       79866.0
maternity leave     8613.0
retiree            21940.0
student            15712.0
unemployed         21014.0
Name: total_income, dtype: float64 2

In [46]:
# Look at the median values for income based on your identified factors
print(new_customer_data.groupby('days_employed')['total_income'].median())
print()
print(new_customer_data.groupby('education')['total_income'].median())
print()
print(new_customer_data.groupby('income_type')['total_income'].median())

days_employed
24.141633        26712.386
24.240695        19858.460
30.195337        37033.790
33.520665        20568.944
34.701045        14489.279
                   ...
371665.278622    16419.472
394949.344851     5595.912
395893.813367    34925.561
397856.565013    15619.310
400992.375704    13954.466
Name: total_income, Length: 15923, dtype: float64

education
bachelor's degree      28054.5310
graduate degree        25161.5835
primary education      18741.9760
secondary education    21836.5830
some college           25618.4640
Name: total_income, dtype: float64

income_type
business           27577.2720
civil servant      24071.6695
employee           22815.1035
entrepreneur       79866.1030
maternity leave     8612.6610
retiree            18962.3180
student            15712.2600
unemployed         21014.3605
Name: total_income, dtype: float64

 We tested the income_type, education and days employed columns as these factors determine how much a person is paid on a regular basis.

We chose the income_type as days employed did not have complete data and the education column seemed to be random. We would use the median total_income because there are outliers in the data.

In [47]:
#  Write a function that we will use for filling in missing values

gpb_total_income = customer_data.groupby('income_type')['total_income'].transform('median')

In [48]:
# Apply it to every row
customer_data['total_income'] =  customer_data['total_income'].fillna(gpb_total_income)

In [49]:
# Check if we got any errors
customer_data.isna().sum()

children                 0
days_employed         2103
dob_years                0
education                0
education_id             0
family_status            0
family_status_id         0
gender                   0
income_type              0
debt                     0
total_income             0
purpose                  0
dob_days                 0
dob_years_category       0
dtype: int64

###  Restoring values in `days_employed`

In [50]:
# Distribution of `days_employed` medians based on your identified parameters

new_customer_data['days_employed'] = round(new_customer_data['days_employed'],0)

new_customer_data['days_employed']

/tmp/ipykernel_28/2151555801.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_customer_data['days_employed'] = round(new_customer_data['days_employed'],0)

0        8438.0
1        4025.0
2        5623.0
3        4125.0
4        2194.0
          ...
21449    4529.0
21450    2194.0
21451    2113.0
21452    3112.0
21453    1985.0
Name: days_employed, Length: 19351, dtype: float64

In [51]:
# Distribution of `days_employed` means & medians based on the dob_years.
new_customer_data = new_customer_data.sort_values('dob_years_category',ascending=False)
mean_days_employed = round(new_customer_data.groupby('dob_years_category')['days_employed'].mean(),2)
median_days_employed = round(new_customer_data.groupby('dob_years_category')['days_employed'].median(),2)
display(mean_days_employed)
display(median_days_employed)

dob_years_category
10-19     633.62
20-29    1214.94
30-39    2027.39
40-49    3953.17
50-59    2878.07
60-69    2563.87
70+      2448.10
Name: days_employed, dtype: float64

dob_years_category
10-19     724.0
20-29    1006.0
30-39    1602.0
40-49    2109.0
50-59    2194.0
60-69    2194.0
70+      2194.0
Name: days_employed, dtype: float64

We would use medians as the data has a lot of outliers.

In [52]:
# Let's write a function that calculates means or medians (depending on your decision) based on your identified parameter

gpb_median = customer_data.groupby('dob_years_category')['days_employed'].transform('median')

In [53]:
# Replacing missing values

customer_data['days_employed'] =  customer_data['days_employed'].fillna(gpb_median)

In [54]:
# Check the entries in all columns - make sure we fixed all missing values
customer_data.isna().sum()

children              0
days_employed         0
dob_years             0
education             0
education_id          0
family_status         0
family_status_id      0
gender                0
income_type           0
debt                  0
total_income          0
purpose               0
dob_days              0
dob_years_category    0
dtype: int64

## Categorization of data

In [55]:
# Print the values for your selected data for categorization

categorised_data = customer_data[['children','dob_years_category','education','family_status','income_type','purpose']]
categorised_data

,children,dob_years_category,education,family_status,income_type,purpose
0,1,40-49,bachelor's degree,married,employee,purchase of the house
1,1,30-39,secondary education,married,employee,car purchase
2,0,30-39,secondary education,married,employee,purchase of the house
3,3,30-39,secondary education,married,employee,supplementary education
4,0,50-59,secondary education,civil partnership,retiree,to have a wedding
...,...,...,...,...,...,...
21449,1,40-49,secondary education,civil partnership,business,housing transactions
21450,0,60-69,secondary education,married,retiree,purchase of a car
21451,1,30-39,secondary education,civil partnership,employee,property
21452,3,30-39,secondary education,married,employee,buying my own car
21453,2,40-49,secondary education,married,employee,to buy a car

Let's check unique values

In [56]:
# Check the unique values

unique_items = ['children','dob_years_category','education','family_status','income_type','purpose']

for item in unique_items:
    display(categorised_data[item].unique())

array([1, 0, 3, 2, 4, 5])

array(['40-49', '30-39', '50-59', '20-29', '60-69', '70+', '10-19'],
      dtype=object)

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

array(['married', 'civil partnership', 'widow', 'divorced', 'unmarried',
       'widower'], dtype=object)

array(['employee', 'retiree', 'business', 'civil servant', 'unemployed',
       'entrepreneur', 'student', 'maternity leave'], dtype=object)

array(['purchase of the house', 'car purchase', 'supplementary education',
       'to have a wedding', 'housing transactions', 'education',
       'having a wedding', 'purchase of the house for my family',
       'buy real estate', 'buy commercial real estate',
       'buy residential real estate', 'construction of own property',
       'property', 'building a property', 'buying a second-hand car',
       'buying my own car', 'transactions with commercial real estate',
       'building a real estate', 'housing',
       'transactions with my real estate', 'cars', 'to become educated',
       'second-hand car purchase', 'getting an education', 'car',
       'wedding ceremony', 'to get a supplementary education',
       'purchase of my own house', 'real estate transactions',
       'getting higher education', 'to own a car', 'purchase of a car',
       'profile education', 'university education',
       'buying property for renting out', 'to buy a car',
       'housing renovation', 'going to university'], dtype=object)

For the children we have 1, 0, 3, 2, 4, 5. For the age group we have 'middle_age', 'youth', 'retired', 'teenager'. For education we have "bachelor's degree", 'secondary education', 'some college','primary education', 'graduate degree' . For family status we have 'married', 'civil partnership', 'widow', 'divorced', 'unmarried','widower'. For income type we have 'employee', 'retiree', 'business', 'civil servant', 'unemployed','entrepreneur', 'student', 'maternity leave' and the purpose column has those listed above.

In [57]:
# Let's write a function to categorize the data based on common topics
        
        
def purpose_cat(row):
    if 'house' in row or 'housing' in row:
        return 'private housing'
    elif 'property' in row:
        return 'commercial housing'
    elif 'car' in row:
        return 'car'
    elif 'education' in row or 'educated' in row:
        return 'education'
    elif 'univeristy' in row:
        return 'education'
    elif 'wedding' in row:
        return 'wedding'
    return 'commercial housing'

In [58]:
# Create a column with the categories and count the values for them

customer_data['purpose_category'] = customer_data['purpose'].apply(purpose_cat)
#customer_data['purpose_category'].value_counts()
customer_data

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,dob_days,dob_years_category,purpose_category
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,15330,40-49,private housing
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,13140,30-39,car
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,12045,30-39,private housing
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,11680,30-39,education
4,0,2194.220567,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,19345,50-59,wedding
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21449,1,4529.316663,43,secondary education,1,civil partnership,1,F,business,0,35966.698,housing transactions,15695,40-49,private housing
21450,0,2194.220567,67,secondary education,1,married,0,F,retiree,0,24959.969,purchase of a car,24455,60-69,car
21451,1,2113.346888,38,secondary education,1,civil partnership,1,M,employee,1,14347.610,property,13870,30-39,commercial housing
21452,3,3112.481705,38,secondary education,1,married,0,M,employee,1,39054.888,buying my own car,13870,30-39,car
21453,2,1984.507589,40,secondary education,1,married,0,F,employee,0,13127.587,to buy a car,14600,40-49,car

Categorizing the children data

In [59]:
# Looking through all the numerical data in your selected column for categorization
def children_status(row):
    value= row['children']
    if value <= 0:
        return ('no children')
    elif (value < 3):
        return ('few children')
    else:
        return ('many children')

In [60]:
# Getting summary statistics for the column

customer_data['children_status'] = customer_data.apply(children_status,axis=1)
customer_data['children_status'].value_counts()

no children      14091
few children      6983
many children      380
Name: children_status, dtype: int64

## Checking the Hypotheses

**Is there a correlation between having children and paying back on time?**

In [67]:
# Check the children data and paying back on time

children_debt = customer_data[['debt','children_status']]
# Calculating default-rate based on the number of children
grp_child_status_default_non_default = customer_data.groupby(['children_status','debt'])['debt'].count()
grp_total_count =  customer_data.groupby(['children_status'])['debt'].count()

grp_child_status_default_non_default/grp_total_count

children_status  debt
few children     0       0.907346
                 1       0.092654
many children    0       0.918421
                 1       0.081579
no children      0       0.924562
                 1       0.075438
Name: debt, dtype: float64

**Conclusion**


The defaulters are represented by 1. We can see that the number of children a person has does not affect a persons ability to pay off their loan. The more children they have, the more likely they are to pay their loans. From the default rates, we see that the default rate for each category is low as compared to the non-default rate. Clients with few children had the highest default rate of 9.3% as compared to the rest which had 8% and 7.5% respectively.

**Is there a correlation between family status and paying back on time?**

In [70]:
# categorizing the family status data

def new_status(row):
    if row['family_status'] == 'married':
        return ('couple')
    if row['family_status'] == 'civil partnership':
        return ('couple')
    if row['family_status'] == 'divorced':
        return 'broken marriage'
    return 'single'

In [71]:
# applying to the family status column

customer_data['new_status'] = customer_data.apply(new_status,axis=1)

In [72]:
family_debt = customer_data[['debt','new_status']]

# Calculating default-rate based on family status

grp_family_default_non_default = customer_data.groupby(['new_status','debt'])['debt'].count()
grp_total_count =  customer_data.groupby(['new_status'])['debt'].count()

grp_family_default_non_default/grp_total_count

new_status       debt
broken marriage  0       0.928870
                 1       0.071130
couple           0       0.920012
                 1       0.079988
single           0       0.910586
                 1       0.089414
Name: debt, dtype: float64

**Conclusion**


After analysing the data, we realised that the family status does not affect a persons likelihood to default on a loan. We see that those who defaulted were less than 10% per category. Single people had the highest default rate of 8.9% as compared to the other categories who had 7 and 8% respectively.

**Is there a correlation between income level and paying back on time?**

In [73]:
# Check the income level data and paying back on time

income_debt = customer_data[['income_type','debt']]




display(income_debt.value_counts())

income_type      debt
employee         0       10023
business         0        4702
retiree          0        3613
civil servant    0        1371
employee         1        1061
business         1         376
retiree          1         216
civil servant    1          86
entrepreneur     0           2
maternity leave  1           1
student          0           1
unemployed       0           1
                 1           1
dtype: int64

In [74]:
# Calculating default-rate based on income level
grp_income_type_default_non_default = customer_data.groupby(['income_type','debt'])['debt'].count()
grp_total_count =  customer_data.groupby(['income_type'])['debt'].count()

grp_income_type_default_non_default/grp_total_count

income_type      debt
business         0       0.925955
                 1       0.074045
civil servant    0       0.940975
                 1       0.059025
employee         0       0.904276
                 1       0.095724
entrepreneur     0       1.000000
maternity leave  1       1.000000
retiree          0       0.943588
                 1       0.056412
student          0       1.000000
unemployed       0       0.500000
                 1       0.500000
Name: debt, dtype: float64

**Conclusion**

100% of those on maternity leave and 50% of the unemployed were defaulters. This shows that income type partly determines a persons ability to pay their loan debt. An unemployed person is may not have any means to pay back the debt given their financial status whilst a person on maternity leave may be preoccupied with taking care of their baby and may not be working or getting paid during that period.

**How does credit purpose affect the default rate?**

In [ ]:
#checking the distribution of the purpose category and debt
purpose_debt = customer_data[['purpose_category','debt']]

purpose_debt.value_counts()

In [75]:
# Check the percentages for default rate for each credit purpose and analyze them
grp_purpose_default_non_default = customer_data.groupby(['purpose_category','debt'])['debt'].count()
grp_total_count =  customer_data.groupby(['purpose_category'])['debt'].count()

grp_purpose_default_non_default/grp_total_count

purpose_category    debt
car                 0       0.906410
                    1       0.093590
commercial housing  0       0.924113
                    1       0.075887
education           0       0.907023
                    1       0.092977
private housing     0       0.932791
                    1       0.067209
wedding             0       0.919966
                    1       0.080034
Name: debt, dtype: float64

**Conclusion**


The credit purpose does not seem to have a major effect on a persons ability to repay back alone. this is evident as the defaulters in each category do not make up upto 10% of the total category.

# General Conclusion 

We examined if a persons income type, education, age, number of children, family status and purpose has an effect on their ability to pay off their loans. These elements did not all seem to have a direct link to the loans not being paid. 

In further investigation, we saw that the income type of the client was the reason why a person would default on paying the loan. This was evident in the scenarios where the client was unemployed and on maternity leave. 100% of those on maternity all defaulted on paying their loans while 50% of the unemployed defaulted in paying their loans.

In conclusion, Income type has an effect on a persons